sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
enum sms_pwm_states {
	PWM_OFF,
	PWM_ON
};

enum sms_states m_device_state;
volatile enum sms_led_states m_led_state;
enum sms_pwm_states m_pwm_state;

typedef struct {
	bool start;
	uint8_t bat_level;
	bool init_ok;
	bool enabled;
}batgauge_struct_t;

batgauge_struct_t m_batgauge_state;

static nrf_saadc_value_t     			m_buffer_pool[2][SAMPLES_IN_BUFFER];
static uint32_t							m_adc_evt_counter;
uint32_t 								m_batgauge_value;
bool									batgauge_new_value = false;
//uint8_t									m_led_blink_cnt;

static uint8_t 							button_mask = 0;
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;/**< Handle of the current connection. */
//static ble_lbs_t                        m_lbs;								/**< LED Button Service instance. */
ble_smss_t								m_smss_service;
static ble_bas_t 						m_bas;                                   /**< Structure used to identify the battery service. */

static low_power_pwm_t					low_power_pwm_0;
static low_power_pwm_t					low_power_pwm_1;


/* ====================================================================
 * VARIABLES
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
// Timers
// app timer definitions
APP_TIMER_DEF(pressure_poll_int_id);
APP_TIMER_DEF(imu_poll_int_id);
APP_TIMER_DEF(button_press_timer_id);
APP_TIMER_DEF(saadc_timer_id);
APP_TIMER_DEF(led0_timer_id);
APP_TIMER_DEF(led1_timer_id);
//APP_TIMER_DEF(micros_cnt_id);

//// drv timer instantiation
//#define TIMER_INSTANCE 1
//const nrf_drv_timer_t TIMER_DELTA_US = NRF_DRV_TIMER_INSTANCE(TIMER_INSTANCE);
//// counter overflow for us timer
//volatile uint32_t micros_cnt_overflow = 0;

// SPI
#define SPI_INSTANCE 0
const nrf_drv_spi_t spi_master_instance = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);
volatile bool spi_xfer_done;
#define SPI_MAX_LENGTH 100
uint8_t m_tx_buf[SPI_MAX_LENGTH] = {0};
uint8_t m_rx_buf[SPI_MAX_LENGTH + 1];

// TWI
#define TWI_INSTANCE 1
const nrf_drv_twi_t twi_master_instance = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE);
volatile bool twi_xfer_done;

// Pressure
extern ms58_output_s ms58_output;
extern ms58_config_s ms58_config;
extern ms58_interrupt_s ms58_interrupt;

// IMU
extern bno055_output_s bno055_output;
extern bno055_config_s bno055_config;
extern bno055_interrupt_s bno055_interrupt;

/* ====================================================================
 * FUNCTIONS DECLARATIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
void advertising_start(void);
//void sensors_start(void);
void sensors_stop(void);
void button_press_timer_start(void);
//void batgauge_init(void);
void batgauge_start(void);


void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
NRF_LOG_INFO("ERROR! ID: %d, PC: %d, INFO: %d\n\r", id, pc, info);
#ifndef DEBUG
	NVIC_SystemReset();
#else
	while(1){};
#endif //DEBUG
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

static void sms_switch_off(bool restart)
{
	uint32_t err_code;
	
	NRF_LOG_INFO("Switching-off SMS sensors...\n\r");
	
	bno055_interrupt.new_value = false;
	bno055_interrupt.rts = false;
	bno055_interrupt.enabled = false;
	
	ms58_interrupt.new_value = false;
	ms58_interrupt.rts = false;
	ms58_interrupt.enabled = false;
	
	if(m_device_state == SMS_ADVERTISING) {
		err_code = sd_ble_gap_adv_stop();
		NRF_LOG_INFO("Adv stop err_code: 0x%04x\n\r", err_code);
		m_device_state = SMS_OFF;
	}
	if(m_device_state == SMS_RUNNING) {
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		NRF_LOG_INFO("Disconnect err_code: 0x%04x\n\r", err_code);
		if(!restart) {
			m_device_state = SMS_OFF;
		}
	}
	
	bsp_board_leds_off();
	app_timer_stop_all();
	
	m_conn_handle = BLE_CONN_HANDLE_INVALID;
}

static void sms_switch_on(void)
{
	NRF_LOG_INFO("Switching-on SMS sensors...\n\r");
	advertising_start();
//	batgauge_start();
}


/* ====================================================================
 * HANDLERS
 * --------------------------------------------------------------------
 * Has to be defined first to be called by the init functions
 * ==================================================================== */
// Timer interrupts
static void pressure_poll_int_handler(void * p_context)
{
	ms58_interrupt.new_value = true;
}

static void imu_poll_int_handler(void * p_context)
{
	bno055_interrupt.new_value = true;
}

static void button_press_timeout_handler(void * p_context)
{
	uint8_t button_state = 0;
	if(app_button_is_pushed(0)) button_state |= 0x01;
	if(app_button_is_pushed(1)) button_state |= 0x10;
	NRF_LOG_DEBUG("Button long press timeout!! Button state = 0x%02x\n\r", button_state);

	if(button_state == button_mask) {
		if(button_state == 0x11) {
			NRF_LOG_INFO("DOUBLE long press!! SMS state: %d\n\r", m_device_state);
			if((m_device_state == SMS_ADVERTISING) || (m_device_state == SMS_RUNNING)) {
				sms_switch_off(false);
			}
		}
		else if((button_state == 0x01) || (button_state == 0x10)) {
			NRF_LOG_INFO("SINGLE long press!! SMS state: %d\n\r", m_device_state);
			if(m_device_state == SMS_OFF) {
				sms_switch_on();
			}
		}
	}
	// Reset button mask to force complete button release before next detection
	button_mask = 0;
}




// Hardware interrupts
/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    uint32_t err_code;
	static uint16_t send_value = 0;

