sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
    switch (pin_no)
    {
        case LEDBUTTON_BUTTON1_PIN:
			if(button_action) send_value |= 0xFF;
			else send_value &= 0xFF00;
			NRF_LOG_DEBUG("Bt1 pressed\r\n", send_value);
			err_code = ble_smss_on_button_change(&m_smss_service, send_value);
			if (err_code != NRF_SUCCESS &&						// 0x0000
				err_code != BLE_ERROR_INVALID_CONN_HANDLE &&	// 0x3002
				err_code != NRF_ERROR_INVALID_STATE &&			// 0x0008
				err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)	// 0x3401
			{
				APP_ERROR_CHECK(err_code);
			}
			
			if(button_action) button_mask |= 0x01;
			else button_mask &= 0xF0;
			
			NRF_LOG_DEBUG("Stopping button timer... mask = 0x%02x\n\r", button_mask);
			app_timer_stop(button_press_timer_id);
			if(button_mask != 0) {
				NRF_LOG_DEBUG("Re-starting button timer...\n\r");
				app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);		
			}
			
            break;

		case LEDBUTTON_BUTTON2_PIN:
			if(button_action) send_value |= 0xFF00;
			else send_value &= 0x00FF;
			NRF_LOG_DEBUG("Bt2 pressed\r\n", send_value);
			err_code = ble_smss_on_button_change(&m_smss_service, send_value);
			if (err_code != NRF_SUCCESS &&						// 0x0000
				err_code != BLE_ERROR_INVALID_CONN_HANDLE &&	// 0x3002
				err_code != NRF_ERROR_INVALID_STATE &&			// 0x0008
				err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)	// 0x3401
			{
				APP_ERROR_CHECK(err_code);
			}

			if(button_action) button_mask |= 0x10;
			else button_mask &= 0x0F;
			
			NRF_LOG_DEBUG("Stopping button timer... mask = 0x%02x\n\r", button_mask);
			app_timer_stop(button_press_timer_id);
			if(button_mask != 0) {
				NRF_LOG_DEBUG("Re-starting button timer...\n\r");
				app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);		
			}

			break;
		
        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}



void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
{
    spi_xfer_done = true;
}
void twi_event_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
	twi_xfer_done = true;
	switch(p_event->type)
	{
		case NRF_DRV_TWI_EVT_DONE:
			twi_xfer_done = true;
			break;
		default:
			break;
	}	
}
void batgauge_event_handler(nrf_drv_saadc_evt_t const * p_event)
{
	NRF_LOG_DEBUG("Batgauge event!!\n\r");
	if(p_event->type == NRF_DRV_SAADC_EVT_DONE)
	{
		ret_code_t err_code;
		err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
		APP_ERROR_CHECK(err_code);
		
		uint8_t i;
		uint32_t sum = 0;
		NRF_LOG_DEBUG("ADC event number: %d\n\r", (int)m_adc_evt_counter);
		for(i = 0; i < SAMPLES_IN_BUFFER; i++)
		{
			m_buffer_pool[0][i] = p_event->data.done.p_buffer[i];
			NRF_LOG_DEBUG("%d\r\n", m_buffer_pool[0][i]);
			sum += m_buffer_pool[0][i];
		}
		m_batgauge_value = sum / SAMPLES_IN_BUFFER;
		NRF_LOG_INFO("Batgauge avg: %d (sum: %d)\n\r", m_batgauge_value, sum);
		m_adc_evt_counter++;
		batgauge_new_value = true;
	}
}
static void saadc_timer_handler(void * p_context)
{
	NRF_LOG_DEBUG("saadc timer done\n\r");
	nrf_drv_saadc_sample();
}

//static void led0_timer_handler(void * p_context)
//{
//	bsp_board_led_invert(ADVERTISING_LED_PIN);
//	switch(m_led_state) {
//		case LED_ADVERTISING:
//			break;
//		case LED_CONNECTED:
//			if(m_led_blink_cnt++ > 4) {
//				bsp_board_led_off(ADVERTISING_LED_PIN);
//				app_timer_stop(led0_timer_id);
//			}
//			break;
//		case LED_GAP_TIMEOUT:
//			if(m_led_blink_cnt++ > 10) {
//				bsp_board_led_off(ADVERTISING_LED_PIN);
//				app_timer_stop(led0_timer_id);
//			}
//			break;
//		default:
//			break;
//	}
//}
//static void led1_timer_handler(void * p_context)
//{
//}

static void pwm_handler(void * p_context)
{
	static uint16_t led_0, led_1;
	static uint8_t blink_cnt;
	uint32_t toggle_max = 0;
	uint32_t err_code;
	UNUSED_PARAMETER(p_context);

	switch(m_led_state) {
		case LED_ADVERTISING:
			toggle_max = SMS_LED_BLINK_MEDIUM_TICKS;
			break;
		case LED_CONNECTING:
			toggle_max = SMS_LED_BLINK_ULTRA_TICKS;
			break;
		case LED_CONNECTED:
		case LED_DISCONNECTED:
		case LED_GAP_TIMEOUT:
		case LED_POLLING:
		case LED_SENDING:
		case LED_CALIBRATING:
		case LED_ERROR:
		default:
			break;
	}

	low_power_pwm_t * pwm_instance = (low_power_pwm_t*)p_context;
	
	
	if(pwm_instance->bit_mask == BSP_LED_0_MASK)
	{
		led_0++;
				
		if(led_0 > toggle_max) {
			NRF_LOG_INFO("PWM. LED: %d, D: %d\n\r", m_led_state, pwm_instance->duty_cycle);
			if(m_led_state == LED_ADVERTISING) {
				if(pwm_instance->duty_cycle > 0) {
					err_code = low_power_pwm_duty_set(pwm_instance, 0);
				}
				else {
					err_code = low_power_pwm_duty_set(pwm_instance, SMS_LED_ON_DUTY);
				}
				APP_ERROR_CHECK(err_code);
			}
			else if(m_led_state == LED_CONNECTING) {
				if(pwm_instance->duty_cycle > 0) {
					blink_cnt++;
					err_code = low_power_pwm_duty_set(pwm_instance, 0);
				}
				else {
					err_code = low_power_pwm_duty_set(pwm_instance, SMS_LED_ON_DUTY);
				}
				APP_ERROR_CHECK(err_code);
				if(blink_cnt > 4) {
					blink_cnt = 0;
					m_pwm_state = PWM_OFF;
					m_led_state = LED_CONNECTED;
					ms58_config.dev_start = true;
					bno055_config.dev_start = true;
					m_batgauge_state.start = true;
				}
			}
			led_0 = 0;
		}
	}
	else if(pwm_instance->bit_mask == BSP_LED_1_MASK)
	{

	}
}

// BLE
/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}
/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;
	
    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
//            sleep_mode_enter();
            break;
        default:
            break;
    }
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

