sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
	m_batgauge_state.enabled = true;
	m_batgauge_state.start = false;

}


/* ====================================================================
 * RUN-TIME FUNCTIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
//static void timers_create(void)
//{
//	uint32_t err_code;
//	err_code = app_timer_create(&pressure_poll_int_id,
//								APP_TIMER_MODE_REPEATED,
//								pressure_poll_int_handler);
//	APP_ERROR_CHECK(err_code);

//	err_code = app_timer_create(&imu_poll_int_id,
//								APP_TIMER_MODE_REPEATED,
//								imu_poll_int_handler);
//	APP_ERROR_CHECK(err_code);
//	
//	err_code = app_timer_create(&button_press_timer_id,
//								APP_TIMER_MODE_SINGLE_SHOT,
//								button_press_timeout_handler);
//	APP_ERROR_CHECK(err_code);
//	
//	err_code = app_timer_create(&saadc_timer_id,
//								APP_TIMER_MODE_REPEATED,
//								saadc_timer_handler);
//	APP_ERROR_CHECK(err_code);
//}


/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


//void sensors_start(void)
//{
//	if(ms58_config.dev_start) {
//		NRF_LOG_INFO("Starting MS58...\n\r");
//		NRF_LOG_INFO("...switch on supply\n\r");
//		nrf_gpio_pin_write(SMS_PRESSURE_SUPPLY_PIN, SMS_PRESSURE_SW_ON);

//		NRF_LOG_INFO("...enable & initialize\n\r");
//		pressure_enable();
//		NRF_LOG_INFO("MS58? %d\r\n", ms58_config.dev_en);

//		NRF_LOG_INFO("...timer\n\r");
//		app_timer_start(pressure_poll_int_id,
//						APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_PRESSURE_POLL_MS, UNIT_1_00_MS), 0),
//						NULL);

//		ms58_interrupt.enabled = ms58_config.dev_en;
//		ms58_config.dev_start = false;
//	}

//	if(bno055_config.dev_start)
//	{
//		NRF_LOG_INFO("Starting BNO055...\n\r");
//		NRF_LOG_INFO("...switch on supply\n\r");
//		nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, SMS_IMU_SW_ON);

//		NRF_LOG_INFO("...enable & initialize\n\r");
//		imu_enable();
//		NRF_LOG_INFO("BNO055? %d\r\n", bno055_config.dev_en);

//		NRF_LOG_INFO("...timer\n\r");
//		app_timer_start(imu_poll_int_id,
//						APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_IMU_POLL_MS, UNIT_1_00_MS), 0),
//						NULL);

//		bno055_interrupt.enabled = bno055_config.dev_en;
//		bno055_config.dev_start = false;
//	}
////	NRF_LOG_INFO("Starting sensors...\n\r");
////	NRF_LOG_INFO("...switch on supply\n\r");
////	nrf_gpio_pin_write(SMS_PRESSURE_SUPPLY_PIN, 1);
////	nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, 1);
////	
////	NRF_LOG_INFO("...enable & initialize: ");
////	pressure_enable();
////	NRF_LOG_INFO("MS58? %d,", ms58_config.dev_en);
////	imu_enable();
////	NRF_LOG_INFO("BNO055? %d\r\n", bno055_config.dev_en);
//	batgauge_start();
//	NRF_LOG_INFO("...batgauge started\n\r");
//	
////	NRF_LOG_INFO("...timers\n\r");
////	app_timer_start(pressure_poll_int_id,
////					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_PRESSURE_POLL_MS, UNIT_1_00_MS), 0),
////					NULL);
////	app_timer_start(imu_poll_int_id,
////					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_IMU_POLL_MS, UNIT_1_00_MS), 0),
////					NULL);
//////	nrf_drv_timer_enable(&TIMER_DELTA_US);
////	
////	ms58_interrupt.enabled = true;
////	bno055_interrupt.enabled = true;
//}

void sensors_stop(void)
{
	NRF_LOG_INFO("Stopping sensors...\n\r");
	NRF_LOG_INFO("...switch off supply\n\r");
	nrf_gpio_pin_write(SMS_PRESSURE_SUPPLY_PIN, SMS_PRESSURE_SW_OFF);
	nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, SMS_IMU_SW_OFF);
	
	NRF_LOG_INFO("...polling timers\n\r");
	app_timer_stop(pressure_poll_int_id);
	app_timer_stop(imu_poll_int_id);

	NRF_LOG_INFO("...batgauge\n\r");
	app_timer_stop(saadc_timer_id);
	
	ms58_interrupt.enabled = false;
	bno055_interrupt.enabled = false;
	m_batgauge_state.enabled = false;
}

void button_press_timer_start(void)
{
	app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);
}



/* ====================================================================
 * MAIN
 * ==================================================================== */
/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    
    // Setup log
	err_code = NRF_LOG_INIT(NULL);
	APP_ERROR_CHECK(err_code);
	uint8_t fw_msb, fw_lsb;
	fw_msb = ((SMS_VERSION_ID & 0xFF) > 8);
	fw_lsb = (SMS_VERSION_ID & 0x0F);
	NRF_LOG_INFO("===============================\n\r");
//	NRF_LOG_INFO("SMS sensors firmware v%d.%d, r%03d\n\r", fw_msb, fw_lsb, SMS_RELEASE_ID);
//	NRF_LOG_INFO("===============================\n\n\r");

	// Initialize hardware & services
//	NRF_LOG_INFO("Initializing hardware...\n\r");
    timers_init();
    leds_init();
	supplies_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

	spi_init();
	twi_init();
	batgauge_init();
	
	// Initialize & configure peripherals
//	pressure_enable();
//	imu_enable();
	ms58_config.dev_start = false;
	bno055_config.dev_start = false;
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
		
	// Start advertising
	advertising_start();
	
	// Enable battery gauge measurement
//	batgauge_start();

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
		
		if(m_pwm_state == PWM_OFF) low_power_pwm_stop(&low_power_pwm_0);

		if(ms58_config.dev_start)
		{
//			NRF_LOG_INFO("Starting MS58...\n\r");
//			NRF_LOG_INFO("...switch on supply\n\r");
			nrf_gpio_pin_write(SMS_PRESSURE_SUPPLY_PIN, SMS_PRESSURE_SW_ON);
	
//			NRF_LOG_INFO("...enable & initialize\n\r");
			pressure_enable();
//			NRF_LOG_INFO("MS58? %d\r\n", ms58_config.dev_en);
	
//			NRF_LOG_INFO("...timer\n\r");
			app_timer_start(pressure_poll_int_id,
							APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_PRESSURE_POLL_MS, UNIT_1_00_MS), 0),
							NULL);
	
			ms58_interrupt.enabled = ms58_config.dev_en;
			ms58_config.dev_start = false;
		}
		
		if(bno055_config.dev_start)
		{
//			NRF_LOG_INFO("Starting BNO055...\n\r");
//			NRF_LOG_INFO("...switch on supply\n\r");
			nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, SMS_IMU_SW_ON);
	
//			NRF_LOG_INFO("...enable & initialize\n\r");
			imu_enable();
//			NRF_LOG_INFO("BNO055? %d\r\n", bno055_config.dev_en);
	
//			NRF_LOG_INFO("...timer\n\r");
			app_timer_start(imu_poll_int_id,
							APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_IMU_POLL_MS, UNIT_1_00_MS), 0),
							NULL);

			bno055_interrupt.enabled = bno055_config.dev_en;
			bno055_config.dev_start = false;
		}
		
		if(m_batgauge_state.start)
		{
			NRF_LOG_INFO("Starting batgauge\n\r");
			batgauge_start();
		}

		if((ms58_interrupt.enabled) && (ms58_interrupt.new_value))
		{
			nrf_gpio_pin_write(DBG1_PIN, 1);
			
			ms58_interrupt.new_value = false;
			pressure_poll_data();
			
			nrf_gpio_pin_write(DBG1_PIN, 0);
		}
		
		if((bno055_interrupt.enabled) && (bno055_interrupt.new_value))
		{
			nrf_gpio_pin_write(DBG2_PIN, 1);

